[{
    "Title":"Kilifi",
    "imagesrc":"/Kilifi.jpeg",
    "PropertyName":"Kilifi Water Front Land",
    "Location":"Kilifi Road, Kilifi, Kenya",
    "Size":"1 Acre",
    "Price":"KES 12,000,000",
    "Amenities":"Beach Front",
    "Description":"Located just minutes from Kilifi’s unspoiled beaches, this 1-acre plot offers a rare blend of privacy and coastal accessibility. Imagine starting each day with a short stroll to the shoreline, where the ocean and horizon meet under a big, open sky.What Makes This Property Stand Out:Beachside Proximity: Walk to the beach in minutes—ideal for easy access to the coast without the crowds.Versatile Potential: Perfect for building a private residence, rental property, or a quiet getaway retreat.Natural Surroundings: Enjoy the relaxed atmosphere with plenty of space for gardens, natural landscaping, and more.This land is well-suited for anyone looking to balance a quiet, natural setting with the perks of coastal living."
},{
    "Title":"Mombasa",
    "imagesrc":"/Mombasa.jpeg",
    "PropertyName":"Mombasa Water Front Land",
    "Location":"Nyali Road, Mombasa, Kenya",
    "Size":"14 Acre",
    "Price":"KES 22,000,000",
    "Amenities":"Access to heritage sites",
    "Description":"This spacious 14-acre plot in Mombasa offers the best of both worlds: a tranquil retreat with proximity to the city’s beautiful beaches and vibrant amenities. Perfectly positioned, this property provides quick access to the coastline while remaining connected to Mombasa's bustling lifestyle.Key Features:Close to the Beach: Just a short distance from Mombasa’s iconic beaches, ideal for relaxed seaside living.Urban Amenities Nearby: Conveniently located near shops, restaurants, and transport hubs.Flexible Usage: Suited for private residence, rental development, or a small business setup.Whether you envision a serene beachside home or an investment with high rental appeal, this plot in Mombasa presents an exciting opportunity to create your own space in a prime coastal location."
},{
    "Title":"Watamu",
    "imagesrc":"/Watamu.jpeg",
    "PropertyName":"Watamu Village Land",
    "Location":"Kanani Road, Watamu, Kenya",
    "Size":"1/2 Acre",
    "Price":"KES 3,000,000",
    "Amenities":"Adjavent to Marine Park",
    "Description":"1/2-Acre Plot in Watamu – Coastal Serenity and Prime Location <br/>Nestled in the stunning seaside town of Watamu, this 1/2-acre plot offers an unmatched location just moments from the area’s breathtaking beaches and rich marine life. Known for its crystal-clear waters and laid-back vibe, Watamu is ideal for those looking for a quiet escape in a highly desirable coastal setting.Property Highlights:Close to Watamu’s Beaches: Walk to the beautiful beaches of Watamu in just minutes, with easy access to snorkeling, diving, and ocean views.Natural Beauty All Around: Surrounded by lush vegetation, this plot provides a peaceful environment in an eco-friendly community.Perfect for Residential or Tourism Ventures: Whether for a private residence, rental property, or small eco-lodge, this land offers endless possibilities.Embrace coastal living in Watamu, where every day brings the beauty of the Indian Ocean right to your doorstep."
},{
    "Title":"Kitengela",
    "imagesrc":"/Kitengela.jpeg",
    "PropertyName":"Kitengela Enkasiti-1 Land",
    "Location":"Enkasiti, Kitengela, Kenya",
    "Size":"1 Acre",
    "Price":"KES 2,500,000",
    "Amenities":"Developing Area",
    "Description":"Prime 1-Acre Plot in Kitengela – Spacious Land in a Thriving AreaLocated in the rapidly growing town of Kitengela, this 1-acre plot offers ample space and a prime location ideal for residential or commercial development. Known for its balance of tranquility and accessibility, Kitengela provides a suburban setting just a short drive from Nairobi, with all essential amenities nearby.Key Features:Proximity to Nairobi: Convenient access to the capital, making it ideal for commuters or business.Developing Area: Situated in a thriving town with new developments, schools, shopping centers, and recreational spots.Perfect for Diverse Uses: Suitable for a family home, rental units, or commercial ventures due to its strategic location.This plot in Kitengela is a great opportunity for anyone looking to invest in a location that’s both serene and connected to the city’s growth."
}]